
 #Область Методы
 
Процедура ВКМ_РассылкаУведомленийВТелеграм() Экспорт
	
	ПолучитьСписокСообщений();

КонецПроцедуры

Процедура ПолучитьСписокСообщений() Экспорт
	
	ИдентификаторЧата = Число(Константы.ВКМ_ИдентификаторГруппыОповещенияВТелеграм.Получить());
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();	
	
	ВыборкаСообщенийЗапрос = Новый Запрос;
	
	ВыборкаСообщенийЗапрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияВТелеграм.ТекстСообщения,
	|	ВКМ_УведомленияВТелеграм.Ссылка
	|ИЗ
	|	Справочник.ВКМ_УведомленияВТелеграм КАК ВКМ_УведомленияВТелеграм
	|ГДЕ
	|	ВКМ_УведомленияВТелеграм.ПометкаУдаления = &ПометкаУдаления";
	
	ВыборкаСообщенийЗапрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	
	РезультатЗапроса = ВыборкаСообщенийЗапрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ТЗСообщений = РезультатЗапроса.Выгрузить();
		ОтправитьHTTPЗапрос(ТЗСообщений, ИдентификаторЧата, Токен);
	
	КонецЕсли;
	
КонецПроцедуры


Процедура УдалитьСообщениеИзСправочника(МассивСообщенийДляУдаления)
	
	Для Каждого Сообщение из МассивСообщенийДляУдаления Цикл
	
	СообщениеОбъект = Сообщение.Ссылка.ПолучитьОбъект();
	СообщениеОбъект.ПометкаУдаления = Истина;
	СообщениеОбъект.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьЗаписьВЖурналеРегистрации(МассивИнформацииДляЖурналаРегистрации)
	
	Для Каждого Сообщение из МассивИнформацииДляЖурналаРегистрации Цикл
	
		ЗаписьЖурналаРегистрации(СтрШаблон("Не удалось отправить следующее уведомление в Telegram: %1", Сообщение),УровеньЖурналаРегистрации.Ошибка);
	
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область Telegram

Процедура ОтправитьHTTPЗапрос(ТЗСообщений, ИдентификаторЧата, Токен)
	
//	Результат = Неопределено;
	
	МассивСообщенийДляУдаления = Новый Массив;
	МассивИнформацииДляЖурналаРегистрации = Новый Массив;
	
	Попытка
		
	СоединениеHTTP = Новый HTTPСоединение("api.telegram.org",443, , , , ,Новый ЗащищенноеСоединениеOpenSSL(, ));

	Для каждого Сообщение Из ТЗСообщений Цикл
	
	Данные = Новый Структура;
	Данные.Вставить("chat_id", ИдентификаторЧата);
	Данные.Вставить("text", Сообщение.ТекстСообщения);
	
	ЗаписьJSON = новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	
	Запрос = Новый HTTPЗапрос("bot" + Токен + "/sendMessage", Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
	РезультатЗапроса=СоединениеHTTP.ОтправитьДляОбработки(Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		 МассивСообщенийДляУдаления.Добавить(Сообщение.Ссылка);
	Иначе
		МассивИнформацииДляЖурналаРегистрации.Добавить(Сообщение.ТекстСообщения)
	КонецЕсли;
	
	КонецЦикла;
	
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	УдалитьСообщениеИзСправочника(МассивСообщенийДляУдаления);
	СформироватьЗаписьВЖурналеРегистрации(МассивИнформацииДляЖурналаРегистрации);
		
КонецПроцедуры



#КонецОбласти