
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Очистка предыдущих движений регистра накопления "ВзаиморасчетыССотрудниками"
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.Записать(); 
	
	//Создание движений по регистру накопления "ВзаиморасчетыССотрудниками"
	
	Для каждого Строка Из ЗарплатаКВыплате Цикл

		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		ДвижениеНакопление = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьРасход();
		ДвижениеНакопление.Период = НачалоМесяца(Дата);
		ДвижениеНакопление.Сотрудник = Строка.Сотрудник;
		ДвижениеНакопление.ВидРасчета = Строка.ВидРасчета;
		ДвижениеНакопление.Сумма = Строка.Сумма; 
		ДвижениеНакопление.Комментарий = Строка.Комментарий;

	КонецЦикла;

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать(); 
	
КонецПроцедуры
