
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	КатегорияСотрудникаСпециалист = ПолучитьЗначениеПеречисления();
	
	Если Запись.Категория = КатегорияСотрудникаСпециалист Тогда
		
		Если ПустаяСтрока(Запись.ПроцентОтРабот) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для данной категории сотрудника необходимо указать размер премии в процентах!" + Символы.ПС + "Данные не сохранены." ;
			Сообщение.Сообщить();
			Отказ = Истина;
		
		Иначе Запись.ПроцентОтРабот = Число(Запись.ПроцентОтРабот);
							
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьЗначениеПеречисления()

	Возврат Перечисления.ВКМ_КатегорииСотрудников.Специалист;
	
КонецФункции

