
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ПроверкаАбонентскогоДоговора(ЭтотОбъект) = Ложь Тогда
		
		Отказ = Истина;
	
	Иначе 
		
		ВыполненныеРаботыСписок = ЭтотОбъект.ВыполненныеРаботы;
		Сотрудник = ЭтотОбъект.Специалист;
		Договор = ЭтотОбъект.Договор;
		ЧасовКОплате = ЭтотОбъект.ВыполненныеРаботы.Итог("ЧасыКОплате");
		СуммаКОплате = ЭтотОбъект.ВыполненныеРаботы.Итог("ЧасыКОплате")*ЭтотОбъект.Договор.ВКМ_СтоимостьЧаса;
		СоздатьДвижениеПоРегиструВыполненныеКлиентуРаботы(ВыполненныеРаботыСписок);
		СоздатьДвижениеПоРегиструНакопленияВыполненныеСотрудникомРаботы(Договор, Сотрудник, ЧасовКОплате, СуммаКОплате);
			
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаАбонентскогоДоговора(ТекущийОбъект) Экспорт
	
	Договор = ТекущийОбъект.Договор;
	
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	
		Если ДатаВыполненияРаботНеСоответствуетДатамДоговора(ТекущийОбъект, Договор) Тогда
		
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
КонецФункции

Функция ДатаВыполненияРаботНеСоответствуетДатамДоговора(ТекущийОбъект, Договор) Экспорт
	
	ДатаВыполненияРабот = ТекущийОбъект.ДатаПроведенияРабот;	
	ДатаНачалаДействияДоговора = Договор.ВКМ_ДатаНачалаДействия;
	ДатаОкончанияДействияДоговора = Договор.ВКМ_ДатаОкончанияДействия;
	
	Если 	
		ДатаВыполненияРабот <= ДатаОкончанияДействияДоговора 
		И ДатаВыполненияРабот >= ДатаНачалаДействияДоговора
	Тогда
		ДатаВыполненияРаботНеСоответствуетДатамДоговора = Ложь;
	Иначе
		ДатаВыполненияРаботНеСоответствуетДатамДоговора = Истина;
	КонецЕсли;
	
	Возврат ДатаВыполненияРаботНеСоответствуетДатамДоговора;
	
КонецФункции

Процедура СоздатьДвижениеПоРегиструВыполненныеКлиентуРаботы(ВыполненныеРаботыСписок)
	
	СтоимостьНормочаса = ЭтотОбъект.Договор.ВКМ_СтоимостьЧаса;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
		
	НаборЗаписей = РегистрыСведений.ВКМ_ВыполненныеКлиентуРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);

	Для Каждого Строка Из ВыполненныеРаботыСписок Цикл 
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = ЭтотОбъект.Клиент;
		Движение.Договор = ЭтотОбъект.Договор;
		Движение.ВидРабот = Строка.ВидРабот;
		Движение.КоличествоЧасов = Строка.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = Строка.ФактическиПотраченоЧасов * СтоимостьНормочаса;
		Движение.Комментарий = Строка.Комментарий;
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();    
	
КонецПроцедуры

Процедура СоздатьДвижениеПоРегиструНакопленияВыполненныеСотрудникомРаботы(Договор, Сотрудник, ЧасовКОплате, СуммаКОплате)
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Сотрудник = ЭтотОбъект.Специалист;
	Движение.ЧасовКОплате = ЧасовКОплате;
	Движение.СуммаКОплате = СуммаКОплате;
	Движение.Договор = Договор;
				
КонецПроцедуры;
