
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РезультатПроверкиПремииПроцентом = ПроверкаУстановленногоПроцентаПремии();
	
	Если ПроверкаАбонентскогоДоговора() = Ложь 
		 ИЛИ РезультатПроверкиПремииПроцентом.ПремияНазначена = Ложь
		 ИЛИ ПроверкаНаличияЗаписейВТЧВыполненныеРаботы() = Ложь 
	
	Тогда
		
		Отказ = Истина;
	
	Иначе 
		
		ВыполненныеРаботыСписок = ЭтотОбъект.ВыполненныеРаботы;
		ПремияПроцентом = РезультатПроверкиПремииПроцентом.ПремияПроцентом;
				
		СоздатьДвижениеПоРегиструВыполненныеКлиентуРаботы(ВыполненныеРаботыСписок);
		СоздатьДвижениеПоРегиструНакопленияВыполненныеСотрудникомРаботы(ПремияПроцентом);
			
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаАбонентскогоДоговора() Экспорт
	
	Договор = ЭтотОбъект.Договор;
	
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	
		Если ДатаВыполненияРаботНеСоответствуетДатамДоговора(Договор) Тогда
		
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПроверкаУстановленногоПроцентаПремии() Экспорт
	
	Специалист = ЭтотОбъект.Специалист;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Категория,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период,) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|ГДЕ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	РезультатСтруктура = Новый Структура;
	
	РезультатСтруктура.Вставить("ПремияНазначена");
	РезультатСтруктура.Вставить("ПремияПроцентом");
		
	Если РезультатЗапроса.Количество() <> 0 Тогда
	
		ПроцентПремии = РезультатЗапроса.ВыгрузитьКолонку("ПроцентОтРабот")[0];
		КатегорияСотрудника = РезультатЗапроса.ВыгрузитьКолонку("Категория")[0];
		
		Если КатегорияСотрудника = Перечисления.ВКМ_КатегорииСотрудников.Специалист Тогда
			
			Если ПроцентПремии = Неопределено ИЛИ ПроцентПремии = "" ИЛИ ПустаяСтрока(ПроцентПремии) Тогда
		
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Для сотрудника не указана премия процентом. Документ не проведен.";
				Сообщение.Сообщить();
				
				РезультатСтруктура.ПремияНазначена = Ложь;
				
			Иначе 
				
				РезультатСтруктура.ПремияНазначена = Истина;
				РезультатСтруктура.ПремияПроцентом = ПроцентПремии;
				
			КонецЕсли;
		
		Иначе 
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Сотрудник не является специалистом, уполномоченным выполнять работы. Документ не проведен.";
				Сообщение.Сообщить();
				
				РезультатСтруктура.ПремияНазначена = Ложь;
		
		КонецЕсли;
		
	Иначе
		
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Для сотрудника не указаны категория и премия процентом. Обратитесь к администратору.";
			Сообщение.Сообщить();
			
			РезультатСтруктура.ПремияНазначена = Ложь;
			
	КонецЕсли;
	
	Возврат РезультатСтруктура;
		
КонецФункции

Функция ПроверкаНаличияЗаписейВТЧВыполненныеРаботы() Экспорт
	
	Если ЭтотОбъект.ВыполненныеРаботы.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не внесены данные о выполненных работах.";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	Иначе 
		
		Возврат Истина;
		
	КонецЕсли;
		
КонецФункции

Функция ДатаВыполненияРаботНеСоответствуетДатамДоговора(Договор) Экспорт
	
	ДатаВыполненияРабот = ЭтотОбъект.ДатаПроведенияРабот;	
	ДатаНачалаДействияДоговора = Договор.ВКМ_ДатаНачалаДействия;
	ДатаОкончанияДействияДоговора = Договор.ВКМ_ДатаОкончанияДействия;
	
	Если 	
		ДатаВыполненияРабот <= ДатаОкончанияДействияДоговора 
		И ДатаВыполненияРабот >= ДатаНачалаДействияДоговора
	Тогда
		ДатаВыполненияРаботНеСоответствуетДатамДоговора = Ложь;
	Иначе
		ДатаВыполненияРаботНеСоответствуетДатамДоговора = Истина;
	КонецЕсли;
	
	Возврат ДатаВыполненияРаботНеСоответствуетДатамДоговора;
	
КонецФункции

Процедура СоздатьДвижениеПоРегиструВыполненныеКлиентуРаботы(ВыполненныеРаботыСписок)
	
	СтоимостьНормочаса = ЭтотОбъект.Договор.ВКМ_СтоимостьЧаса;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();

	//++ Исправление замечаний к дипломной работе 29.07.24	
	НаборЗаписей = РегистрыНакопления.ВКМ_ВыполненныеКлиентуРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	
	Для Каждого Строка Из ВыполненныеРаботыСписок Цикл 
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Клиент = ЭтотОбъект.Клиент;
		Движение.КоличествоЧасов = Строка.ЧасыКОплате;
		Движение.СуммаКОплате = Строка.ЧасыКОплате * СтоимостьНормочаса;
		Движение.Договор = ЭтотОбъект.Договор;
		Движение.ВидРабот = Строка.ВидРабот;
		Движение.Комментарий = Строка.Комментарий;
		
	КонецЦикла; 	
	//--
	
	НаборЗаписей.Записать();  

КонецПроцедуры

Процедура СоздатьДвижениеПоРегиструНакопленияВыполненныеСотрудникомРаботы(ПремияПроцентом)
	
	Сотрудник = ЭтотОбъект.Специалист;
	Договор = ЭтотОбъект.Договор;
	ЧасовКОплате = ЭтотОбъект.ВыполненныеРаботы.Итог("ЧасыКОплате");
	СуммаКОплате = ЭтотОбъект.ВыполненныеРаботы.Итог("ЧасыКОплате")*ЭтотОбъект.Договор.ВКМ_СтоимостьЧаса*ПремияПроцентом/100;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Сотрудник = ЭтотОбъект.Специалист;
	Движение.ЧасовКОплате = ЧасовКОплате;
	Движение.СуммаКОплате = СуммаКОплате;
	Движение.Договор = Договор;
				
КонецПроцедуры;
