
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РезультатПроверкиПремииПроцентом = ПроверкаУстановленногоПроцентаПремии(ЭтотОбъект);
	
	Если ПроверкаАбонентскогоДоговора(ЭтотОбъект) = Ложь 
		 ИЛИ РезультатПроверкиПремииПроцентом[0] = Ложь
//		 ИЛИ ПроверкаНаличияЗаписейВТЧВыполненныеРаботы(ЭтотОбъект) = ЛОЖЬ 
	
	Тогда
		
		Отказ = Истина;
	
	Иначе 
		
		ВыполненныеРаботыСписок = ЭтотОбъект.ВыполненныеРаботы;
		ПремияПроцентом = РезультатПроверкиПремииПроцентом[1];
				
		СоздатьДвижениеПоРегиструВыполненныеКлиентуРаботы(ВыполненныеРаботыСписок);
		СоздатьДвижениеПоРегиструНакопленияВыполненныеСотрудникомРаботы(ЭтотОбъект, ПремияПроцентом);
			
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаАбонентскогоДоговора(ТекущийОбъект) Экспорт
	
	Договор = ТекущийОбъект.Договор;
	
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	
		Если ДатаВыполненияРаботНеСоответствуетДатамДоговора(ТекущийОбъект, Договор) Тогда
		
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПроверкаУстановленногоПроцентаПремии(ТекущийОбъект) Экспорт
	
	Специалист = ТекущийОбъект.Специалист;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Категория,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период,) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|ГДЕ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивРезультата = Новый Массив;
		
	Если РезультатЗапроса.Количество() <> 0 Тогда
	
		ПроцентПремии = РезультатЗапроса.ВыгрузитьКолонку("ПроцентОтРабот")[0];
		КатегорияСотрудника = РезультатЗапроса.ВыгрузитьКолонку("Категория")[0];
		
		Если КатегорияСотрудника = Перечисления.ВКМ_КатегорииСотрудников.Специалист Тогда
			
			Если ПроцентПремии = Неопределено ИЛИ ПроцентПремии = "" ИЛИ ПустаяСтрока(ПроцентПремии) Тогда
		
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Для сотрудника не указана премия процентом. Документ не проведен.";
				Сообщение.Сообщить();
				
				МассивРезультата.Добавить(Ложь);
				
			Иначе 
				
				МассивРезультата.Добавить(Истина);
				МассивРезультата.Добавить(ПроцентПремии);
				
			КонецЕсли;
		
		Иначе 
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Сотрудник не является специалистом, уполномоченным выполнять работы. Документ не проведен.";
				Сообщение.Сообщить();
				
			МассивРезультата.Добавить(Ложь);
		
		КонецЕсли;
		
	Иначе
		
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Для сотрудника не указаны категория и премия процентом. Обратитесь к администратору.";
			Сообщение.Сообщить();
			
			МассивРезультата.Добавить(Ложь);
			
	КонецЕсли;
	
	Возврат МассивРезультата;
		
КонецФункции

Функция ПроверкаНаличияЗаписейВТЧВыполненныеРаботы(ТекущийОбъект) Экспорт
	
	Если ТекущийОбъект.ВыполненныеРаботы.Количество() = 0 Тогда
		
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не внесены данные о выполненных работах.";
			Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
		
КонецФункции

Функция ДатаВыполненияРаботНеСоответствуетДатамДоговора(ТекущийОбъект, Договор) Экспорт
	
	ДатаВыполненияРабот = ТекущийОбъект.ДатаПроведенияРабот;	
	ДатаНачалаДействияДоговора = Договор.ВКМ_ДатаНачалаДействия;
	ДатаОкончанияДействияДоговора = Договор.ВКМ_ДатаОкончанияДействия;
	
	Если 	
		ДатаВыполненияРабот <= ДатаОкончанияДействияДоговора 
		И ДатаВыполненияРабот >= ДатаНачалаДействияДоговора
	Тогда
		ДатаВыполненияРаботНеСоответствуетДатамДоговора = Ложь;
	Иначе
		ДатаВыполненияРаботНеСоответствуетДатамДоговора = Истина;
	КонецЕсли;
	
	Возврат ДатаВыполненияРаботНеСоответствуетДатамДоговора;
	
КонецФункции

Процедура СоздатьДвижениеПоРегиструВыполненныеКлиентуРаботы(ВыполненныеРаботыСписок)
	
	СтоимостьНормочаса = ЭтотОбъект.Договор.ВКМ_СтоимостьЧаса;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
		
	НаборЗаписей = РегистрыСведений.ВКМ_ВыполненныеКлиентуРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);

	Для Каждого Строка Из ВыполненныеРаботыСписок Цикл 
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = ЭтотОбъект.Клиент;
		Движение.Договор = ЭтотОбъект.Договор;
		Движение.ВидРабот = Строка.ВидРабот;
		Движение.КоличествоЧасов = Строка.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = Строка.ФактическиПотраченоЧасов * СтоимостьНормочаса;
		Движение.Комментарий = Строка.Комментарий;
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();    
	
КонецПроцедуры

Процедура СоздатьДвижениеПоРегиструНакопленияВыполненныеСотрудникомРаботы(ТекущийОбъект, ПремияПроцентом)
	
	Сотрудник = ТекущийОбъект.Специалист;
	Договор = ТекущийОбъект.Договор;
	ЧасовКОплате = ТекущийОбъект.ВыполненныеРаботы.Итог("ЧасыКОплате");
	СуммаКОплате = ТекущийОбъект.ВыполненныеРаботы.Итог("ЧасыКОплате")*ЭтотОбъект.Договор.ВКМ_СтоимостьЧаса*ПремияПроцентом/100;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Сотрудник = ЭтотОбъект.Специалист;
	Движение.ЧасовКОплате = ЧасовКОплате;
	Движение.СуммаКОплате = СуммаКОплате;
	Движение.Договор = Договор;
				
КонецПроцедуры;
