
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ПроверкаАбонентскогоДоговора(ЭтотОбъект) = Ложь Тогда
		
		Отказ = Истина;
	
	Иначе 
		
		ВыполненныеРаботыСписок = ЭтотОбъект.ВыполненныеРаботы;
		СоздатьДвижениеПоРегистру(ВыполненныеРаботыСписок);
	
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаАбонентскогоДоговора(ТекущийОбъект) Экспорт
	
	Договор = ТекущийОбъект.Договор;
	
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	
		Если ДатаВыполненияРаботНеСоответствуетДатамДоговора(ТекущийОбъект, Договор) Тогда
		
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
КонецФункции

Функция ДатаВыполненияРаботНеСоответствуетДатамДоговора(ТекущийОбъект, Договор) Экспорт
	
	ДатаВыполненияРабот = ТекущийОбъект.ДатаПроведенияРабот;	
	ДатаНачалаДействияДоговора = Договор.ВКМ_ДатаНачалаДействия;
	ДатаОкончанияДействияДоговора = Договор.ВКМ_ДатаОкончанияДействия;
	
	Если 	
		ДатаВыполненияРабот <= ДатаОкончанияДействияДоговора 
		И ДатаВыполненияРабот >= ДатаНачалаДействияДоговора
	Тогда
		ДатаВыполненияРаботНеСоответствуетДатамДоговора = Ложь;
	Иначе
		ДатаВыполненияРаботНеСоответствуетДатамДоговора = Истина;
	КонецЕсли;
	
	Возврат ДатаВыполненияРаботНеСоответствуетДатамДоговора;
КонецФункции

Процедура СоздатьДвижениеПоРегистру(ВыполненныеРаботыСписок)
	
	СтоимостьНормочаса = ЭтотОбъект.Договор.ВКМ_СтоимостьЧаса;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
	Для каждого Строка из ВыполненныеРаботыСписок Цикл
	
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = ЭтотОбъект.Клиент;
		Движение.Договор = ЭтотОбъект.Договор;
		Движение.ВидРабот = Строка.ВидРабот;
		Движение.КоличествоЧасов = Строка.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = Строка.ФактическиПотраченоЧасов * СтоимостьНормочаса;
		Движение.Комментарий = Строка.Комментарий;
	
	КонецЦикла;
		
КонецПроцедуры;
