
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЗ = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилище);
	
	ДиаграммаГанта.Очистить();
	
	Шкала = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы[0];
	Шкала.Единица = ТипЕдиницыШкалыВремени.Неделя;
	
	Для каждого Строка Из ТЗ Цикл
	
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Серия = ДиаграммаГанта.УстановитьСерию(Строка.НомерЗаписиПоСотруднику);
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;
		
КонецПроцедуры
