#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ПроверкаАбонентскогоДоговора(ТекущийОбъект) = Ложь Тогда
	
		ОбщегоНазначения.СообщитьПользователю("Указанный договор не действует в запланированную дату выполнения работ");
		Отказ = Истина;
	
	КонецЕсли;
	
	МассивИзмененийДляУведомленияВТелеграм = Новый Массив;
	
	ИсходныйДокумент = ТекущийОбъект.Ссылка;
	
	Если ИсходныйДокумент.Пустая() Тогда
	

	МассивИзмененийДляУведомленияВТелеграм.Добавить(СтрШаблон("Создана новая заявка на обслуживание: "));
	МассивИзмененийДляУведомленияВТелеграм.Добавить(СтрШаблон("Дата проведения работ: %1 ", Формат(ТекущийОбъект.ДатаПроведенияРабот,"ДФ=dd.MM.yy;")));
	МассивИзмененийДляУведомленияВТелеграм.Добавить(СтрШаблон("Время начала работ: %1 ", Формат(ТекущийОбъект.ВремяНачалаРабот,"Л=ru_RU; ДЛФ=T;")));		
	МассивИзмененийДляУведомленияВТелеграм.Добавить(СтрШаблон("Время окончания работ: %1 ", Формат(ТекущийОбъект.ВремяОкончанияРабот,"Л=ru_RU; ДЛФ=T;")));		
	МассивИзмененийДляУведомленияВТелеграм.Добавить(СтрШаблон("Назначенный специалист: %1 ", ТекущийОбъект.Специалист));		
		
	Иначе
	
	ИсходныйДокумент = ИсходныйДокумент.ПолучитьОбъект();
	ДатаПроведенияРаботИсходная = Формат(ИсходныйДокумент.ДатаПроведенияРабот,"ДФ=dd.MM.yy;");
	ВремяНачалаРаботИсходное = Формат(ИсходныйДокумент.ВремяНачалаРабот,"Л=ru_RU; ДЛФ=T;");
	ВремяОкончанияРаботИсходное = Формат(ИсходныйДокумент.ВремяОкончанияРабот, "Л=ru_RU; ДЛФ=T;");
	СпециалистИсходный = ИсходныйДокумент.Специалист;
		
	ДатаПроведенияРаботНовая = Формат(ТекущийОбъект.ДатаПроведенияРабот,"ДФ=dd.MM.yy;");
	ВремяНачалаРаботНовое = Формат(ТекущийОбъект.ВремяНачалаРабот,"Л=ru_RU; ДЛФ=T;");
	ВремяОкончанияРаботНовое = Формат(ТекущийОбъект.ВремяОкончанияРабот,"Л=ru_RU; ДЛФ=T;");
	СпециалистНовый = ТекущийОбъект.Специалист;
				
	Если ДатаПроведенияРаботНовая <> ДатаПроведенияРаботИсходная ИЛИ
		 ВремяНачалаРаботНовое <> ВремяНачалаРаботИсходное ИЛИ
		 ВремяОкончанияРаботНовое <> ВремяОкончанияРаботИсходное ИЛИ
		 СпециалистНовый <> СпециалистИсходный Тогда
		 	
		МассивИзмененийДляУведомленияВТелеграм.Добавить(СтрШаблон("В заявку на обслуживание № %1 внесены следующие изменения: ", Объект.Номер));
	
	КонецЕсли;
		
	Если ДатаПроведенияРаботНовая <> ДатаПроведенияРаботИсходная Тогда
		МассивИзмененийДляУведомленияВТелеграм.Добавить(СтрШаблон("Дата проведения работ изменена с %1 на %2: ", ДатаПроведенияРаботИсходная, ДатаПроведенияРаботНовая));
	КонецЕсли;
	
	Если ВремяНачалаРаботНовое <> ВремяНачалаРаботИсходное Тогда
		МассивИзмененийДляУведомленияВТелеграм.Добавить(СтрШаблон("Время начала работ изменено с %1 на %2: ", ВремяНачалаРаботИсходное, ВремяНачалаРаботНовое));
	КонецЕсли;
	
	Если ВремяОкончанияРаботНовое <> ВремяОкончанияРаботИсходное Тогда
		МассивИзмененийДляУведомленияВТелеграм.Добавить(СтрШаблон("Время окончания работ изменено с %1 на %2: ", ВремяОкончанияРаботИсходное, ВремяОкончанияРаботНовое));
	КонецЕсли;	

	Если СпециалистНовый <> СпециалистИсходный Тогда
		МассивИзмененийДляУведомленияВТелеграм.Добавить(СтрШаблон("Ответственный специалист изменен с %1 на %2: ", СпециалистИсходный, СпециалистНовый));
	КонецЕсли;	
	
	КонецЕсли;	

	УведомлениеДляТелеграм = СтрСоединить(МассивИзмененийДляУведомленияВТелеграм, Символы.ПС);
	
	Если СтрДлина(УведомлениеДляТелеграм) <> 0 Тогда
	
		НовоеУведомление = Справочники.ВКМ_УведомленияВТелеграм.СоздатьЭлемент();
		НовоеУведомление.ТекстСообщения = УведомлениеДляТелеграм;
		НовоеУведомление.Записать();
		
		ОбщегоНазначения.СообщитьПользователю(УведомлениеДляТелеграм);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти