
&НаКлиенте
Процедура ДиаграммаГанта(Команда)
	
	Адрес = ДиаграммаГантаНаСервере();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВоВременномХранилище", Адрес);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафикаОтпусков", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Функция ДиаграммаГантаНаСервере()
	
	ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтпусков);
		 
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ИтоговаяДлительностьОтпуска.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИтоговаяДлительностьОтпуска.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	Строка = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда 
		РассчитатьДлительностьОтпуска(Строка);
		РассчитатьПорядковыйНомерОтпускаВГоду(Строка);
	КонецЕсли;
	
	Элементы.ИтоговаяДлительностьОтпуска.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	Строка = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда 
		РассчитатьДлительностьОтпуска(Строка);
		РассчитатьПорядковыйНомерОтпускаВГоду(Строка);
	КонецЕсли;
	
	Элементы.ОтпускаСотрудников.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДлительностьОтпуска(Строка)
	
	Строка.Длительность = ((Строка.ДатаОкончания - Строка.ДатаНачала)/86400) + 1;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПорядковыйНомерОтпускаВГоду(Строка)
	
	Сотрудник = Строка.Сотрудник;
	НомерСтроки = Строка.НомерСтроки;
	
	Строка.НомерЗаписиПоСотруднику = РассчитатьПорядковыйНомерОтпускаВГодуНаСервере(Сотрудник, НомерСтроки) + 1;
	
КонецПроцедуры

&НаСервере
Функция РассчитатьПорядковыйНомерОтпускаВГодуНаСервере(Сотрудник, НомерСтроки)
	
	ЭтотОбъект.Записать();
	
	Если НомерСтроки = 1 Тогда
		
		Возврат 0;
	
	Иначе
			
		Н = 0;
		КоличествоОтпусковСотрудника = 0;
		
		Пока Н < (НомерСтроки - 1) Цикл
		
			ТекущаяСтрока = Объект.ОтпускаСотрудников.Получить(Н);
			
			Если ТекущаяСтрока.Сотрудник = Сотрудник Тогда 	
				КоличествоОтпусковСотрудника = КоличествоОтпусковСотрудника + 1;
			КонецЕсли;
			
			Н = Н+1;	
					
		КонецЦикла;
		
			Возврат КоличествоОтпусковСотрудника;
		
	КонецЕсли;
				
КонецФункции

