
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Очистка предыдущих движений регистра накопления "ВзаиморасчетыССотрудниками"
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать(); 
	
	//Формирование движений
	
	Для каждого Строка из СписокСотрудников Цикл
		
		СформироватьДвижениеПоРегиструДополнительныеНачисления(Строка);
		СформироватьДвижениеПоРегиструУдержания(строка);
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

Процедура 	СформироватьДвижениеПоРегиструДополнительныеНачисления(Строка)
	
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;		
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Сумма = Строка.Сумма;
		
		СформироватьПриходПоРегиструНакопленияВзаиморасчетыССотрудниками(Движение);
		
КонецПроцедуры

Процедура 	СформироватьПриходПоРегиструНакопленияВзаиморасчетыССотрудниками(Движение)
	
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		ДвижениеНакопление = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		ДвижениеНакопление.Период = Движение.ПериодДействияКонец;
		ДвижениеНакопление.Сотрудник = Движение.Сотрудник;
		ДвижениеНакопление.ВидРасчета = Движение.ВидРасчета;
		ДвижениеНакопление.Сумма = Движение.Сумма; 
		
КонецПроцедуры

Процедура 	СформироватьДвижениеПоРегиструУдержания(Строка)
	
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);		
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Сумма = Строка.Сумма * 0.13;
		Движение.Комментарий = Строка(ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия);
		
		СформироватьРасходПоРегиструНакопленияВзаиморасчетыССотрудниками(Движение);
		
КонецПроцедуры

Процедура 	СформироватьРасходПоРегиструНакопленияВзаиморасчетыССотрудниками(Движение)
	
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		ДвижениеНакопление = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьРасход();
		ДвижениеНакопление.Период = Движение.ПериодДействияКонец;
		ДвижениеНакопление.Сотрудник = Движение.Сотрудник;
		ДвижениеНакопление.ВидРасчета = Движение.ВидРасчета;
		ДвижениеНакопление.Сумма = Движение.Сумма; 
		ДвижениеНакопление.Комментарий = Движение.Комментарий;
		
КонецПроцедуры
