
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Очистка предыдущих движений регистра накопления "ВзаиморасчетыССотрудниками"
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать(); 
	
	//++ Исправление замечаний к дипломной работе 30.07.24
	//Получение списка сотрудников без дублей
	
	Запрос = Новый Запрос;       
	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,
	                |	СУММА(ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сумма) КАК Сумма
	                |ИЗ
	                |	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
	                |ГДЕ
	                |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = &Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник";   
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//--  
	
	//Формирование движений
	
	СформироватьДвижениеПоРегиструДополнительныеНачисления(ТЗ);
	СформироватьДвижениеПоРегиструУдержания(ТЗ);
		
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

Процедура 	СформироватьДвижениеПоРегиструДополнительныеНачисления(ТЗ)
	
	Для Каждого Строка Из ТЗ Цикл
	
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = НачалоДня(КонецМесяца(Дата));
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = НачалоДня(КонецМесяца(Дата));
		Движение.ПериодРегистрации = Дата;		
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Сумма = Строка.Сумма;
		
		СформироватьПриходПоРегиструНакопленияВзаиморасчетыССотрудниками(Движение);  
		
	КонецЦикла;
	
		Движения.ВКМ_ДополнительныеНачисления.Записать();
		
КонецПроцедуры

Процедура 	СформироватьПриходПоРегиструНакопленияВзаиморасчетыССотрудниками(Движение)
	
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		ДвижениеНакопление = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		ДвижениеНакопление.Период = Движение.ПериодДействияКонец;
		ДвижениеНакопление.Сотрудник = Движение.Сотрудник;
		ДвижениеНакопление.ВидРасчета = Движение.ВидРасчета;
		ДвижениеНакопление.Сумма = Движение.Сумма; 
		
КонецПроцедуры

Процедура 	СформироватьДвижениеПоРегиструУдержания(ТЗ)
	
	Для каждого Строка Из ТЗ Цикл
			
		ДвижениеУдержание = Движения.ВКМ_Удержания.Добавить();
		ДвижениеУдержание.Сторно = Ложь;
		ДвижениеУдержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеУдержание.БазовыйПериодНачало = НачалоМесяца(Дата);
		ДвижениеУдержание.БазовыйПериодКонец = НачалоДня(КонецМесяца(Дата));
		ДвижениеУдержание.ПериодДействияНачало = НачалоМесяца(Дата);
		ДвижениеУдержание.ПериодДействияКонец = НачалоДня(КонецМесяца(Дата));
		ДвижениеУдержание.ПериодРегистрации = Дата;
		ДвижениеУдержание.Сотрудник = Строка.Сотрудник;
		ДвижениеУдержание.Комментарий = ПолучитьКомментарийКДвижениямПоНДФЛДляДополнительныхНачислений();   
		
	КонецЦикла;

	Движения.ВКМ_Удержания.Записать();
	РасчитатьНДФЛ();
                  	
КонецПроцедуры  

Процедура РасчитатьНДФЛ()

	Запрос = Новый Запрос;
	
//	Запрос.Текст = 	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               	|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
//	               	|	ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
//	               	|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.СуммаБаза, 0) КАК ДопНачисления
//	               	|ИЗ
//	               	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
//	               	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(
//	               	|				&Измерения,
//	               	|				&Измерения,
//	               	|				,
//	               	|				Регистратор = &Ссылка
//	               	|					И ВидРасчета = &НДФЛ) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
//	               	|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки
//	               	|			И ВКМ_Удержания.Сотрудник = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Сотрудник
//	               	|ГДЕ
//	               	|	ВКМ_Удержания.Регистратор = &Ссылка
//	               	|	И ВКМ_Удержания.ВидРасчета = &НДФЛ";

	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.СуммаБаза, 0)) КАК ДопНачисления,
	|	ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.БазовыйПериодНачало,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.БазовыйПериодКонец
	|ПОМЕСТИТЬ СуммаБаза
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения,, ВидРасчета = &НДФЛ
	|		И Регистратор = &Ссылка) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
	|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки
	|		И ВКМ_Удержания.Сотрудник = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Сотрудник
	|ГДЕ
	|	ВКМ_Удержания.Регистратор = &Ссылка
	|	И ВКМ_Удержания.ВидРасчета = &НДФЛ
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_Удержания.Сотрудник,
	|	ВКМ_Удержания.НомерСтроки,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.БазовыйПериодНачало,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.БазовыйПериодКонец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_Удержания.Сотрудник,
	|	СУММА(ЕСТЬNULL(ВКМ_Удержания.Сумма, 0)) КАК СуммаУдержанногоНДФЛ,
	|	ВКМ_Удержания.БазовыйПериодНачало,
	|	ВКМ_Удержания.БазовыйПериодКонец
	|ПОМЕСТИТЬ УдержанныйНДФЛ
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|ГДЕ
	|	ВКМ_Удержания.Комментарий = &Комментарий
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_Удержания.Сотрудник,
	|	ВКМ_Удержания.БазовыйПериодНачало,
	|	ВКМ_Удержания.БазовыйПериодКонец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммаБаза.Сотрудник,
	|	СуммаБаза.ДопНачисления,
	|	ЕСТЬNULL(УдержанныйНДФЛ.СуммаУдержанногоНДФЛ, 0) КАК СуммаУдержанногоНДФЛ,
	|	СуммаБаза.НомерСтроки
	|ИЗ
	|	СуммаБаза КАК СуммаБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ УдержанныйНДФЛ КАК УдержанныйНДФЛ
	|		ПО УдержанныйНДФЛ.Сотрудник = СуммаБаза.Сотрудник
	|		И СуммаБаза.БазовыйПериодНачало = УдержанныйНДФЛ.БазовыйПериодНачало
	|		И СуммаБаза.БазовыйПериодКонец = УдержанныйНДФЛ.БазовыйПериодКонец";
		
	Измерения = Новый Массив();
	Измерения.Добавить("Сотрудник");
				
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	Запрос.УстановитьПараметр("НДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	Запрос.УстановитьПараметр("Комментарий", ПолучитьКомментарийКДвижениямПоНДФЛДляДополнительныхНачислений());
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка <> Неопределено Тогда     
		
		Пока Выборка.Следующий() Цикл 
			
			Если Выборка.ДопНачисления <> 0 Тогда
				
				ДвижениеРасчетНДФЛ = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1]; 
				
				СтавкаНДФЛ = 0.13;
				СуммаНДФЛНачислено = Выборка.ДопНачисления*СтавкаНДФЛ;
				СуммаНДФЛУдержано = Выборка.СуммаУдержанногоНДФЛ;
								
				ДвижениеРасчетНДФЛ.Сумма = СуммаНДФЛНачислено - СуммаНДФЛУдержано; 
				
				СформироватьРасходПоРегиструНакопленияВзаиморасчетыССотрудниками(ДвижениеРасчетНДФЛ);
				
			Иначе 
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Сумма НДФЛ не рассчитана. Обратитесь к администратору системы";  
				Сообщение.Сообщить ();
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКомментарийКДвижениямПоНДФЛДляДополнительныхНачислений()
	
		Возврат Строка(ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия);
	
КонецФункции


Процедура 	СформироватьРасходПоРегиструНакопленияВзаиморасчетыССотрудниками(Движение)
	
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		ДвижениеНакопление = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьРасход();
		ДвижениеНакопление.Период = Движение.ПериодДействияКонец;
		ДвижениеНакопление.Сотрудник = Движение.Сотрудник;
		ДвижениеНакопление.ВидРасчета = Движение.ВидРасчета;
		ДвижениеНакопление.Сумма = Движение.Сумма; 
		ДвижениеНакопление.Комментарий = Движение.Комментарий;
		
КонецПроцедуры
