
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Движения.ВКМ_ОтпускаСотрудников.Очистить();
		Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
		Движения.ВКМ_ОтпускаСотрудников.Записать(); 
		
		Для каждого Строка из ОтпускаСотрудников Цикл
	
			Если Строка.Длительность <> 0 Тогда
			
				Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
				ДвижениеНакопление = Движения.ВКМ_ОтпускаСотрудников.ДобавитьПриход();
				ДвижениеНакопление.Период = Строка.ДатаОкончания;
				ДвижениеНакопление.Сотрудник = Строка.Сотрудник;
				ДвижениеНакопление.КоличествоДней = Строка.Длительность; 
				
			КонецЕсли;
			
		КонецЦикла;
		
		Движения.ВКМ_ОтпускаСотрудников.Записать(); 
			
КонецПроцедуры
