
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Курсор = Период.ДатаНачала;
	
	Пока Курсор < Период.ДатаОкончания Цикл
		
		Запись = РегистрыСведений.ВКМ_ГрафикРаботы.СоздатьМенеджерЗаписи();
		Запись.Дата = Курсор;
		Если ДеньНедели(Курсор) <= 5 Тогда
			Запись.РабочихДней = 1;
		КонецЕсли;
		
	Запись.Записать();
	
	Курсор = Курсор + 86400;
	
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = СтрШаблон("Данные графика заполнены для периода %1 - %2.", Период.ДатаНачала, Период.ДатаОкончания);
	Сообщение.Сообщить();
	
КонецПроцедуры
