
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Начисления.Количество() <> 0 Тогда
	
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Категория,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад,
		|	ВКМ_НачисленияЗарплатыНачисления.Сотрудник,
		|	ВКМ_НачисленияЗарплатыНачисления.ВидРасчета,
		|	ВКМ_НачисленияЗарплатыНачисления.ДатаНачала,
		|	ВКМ_НачисленияЗарплатыНачисления.ДатаОкончания,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход
		|ИЗ
		|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
		|		ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период,) КАК
		|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_НачисленияЗарплатыНачисления.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|		ПРАВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,
		|			Месяц,) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
		|		ПО ВКМ_НачисленияЗарплатыНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
		|ГДЕ
		|	ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("Ссылка", Ссылка);	
		
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
		
		Для каждого Строка из РезультатЗапроса Цикл
		
				Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				
					Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
					Движение.Сторно = Ложь;
					Движение.ВидРасчета = Строка.ВидРасчета;
					Движение.ПериодДействияНачало = Строка.ДатаНачала;
					Движение.ПериодДействияКонец = Строка.ДатаОкончания;
					Движение.ПериодРегистрации = Дата;		
					Движение.Сотрудник = Строка.Сотрудник;
					Движение.Показатель = Строка.Оклад;
					
					Движение = Движения.ВКМ_Удержания.Добавить();
					Движение.Сторно = Ложь;
					Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
					Движение.ПериодДействияНачало = Строка.ДатаНачала;
					Движение.ПериодДействияКонец = Строка.ДатаОкончания;
					Движение.ПериодРегистрации = Дата;
					Движение.Сотрудник = Строка.Сотрудник;
					
					Если Строка.Категория = Перечисления.ВКМ_КатегорииСотрудников.Специалист Тогда
					
						Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
						Движение.Сторно = Ложь;
						Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПремияПроцентом;
						Движение.ПериодДействияНачало = Строка.ДатаНачала;
						Движение.ПериодДействияКонец = Строка.ДатаОкончания;
						Движение.ПериодРегистрации = Дата;		
						Движение.Сотрудник = Строка.Сотрудник;	
						Движение.Показатель = Строка.ПроцентОтРабот;
						Движение.Сумма = Строка.СуммаКОплатеПриход;
								
						Движение = Движения.ВКМ_Удержания.Добавить();
						Движение.Сторно = Ложь;
						Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
						Движение.ПериодДействияНачало = Строка.ДатаНачала;
						Движение.ПериодДействияКонец = Строка.ДатаОкончания;
						Движение.ПериодРегистрации = Дата;
						Движение.Сотрудник = Строка.Сотрудник;
						Движение.Сумма = Строка.СуммаКОплатеПриход * 0.13;
					
					КонецЕсли;
					
				ИначеЕсли Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
					
					Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
					Движение.Сторно = Ложь;
					Движение.ВидРасчета = Строка.ВидРасчета;
					Движение.ПериодДействияНачало = Строка.ДатаНачала;
					Движение.ПериодДействияКонец = Строка.ДатаОкончания;
					Движение.ПериодРегистрации = Дата;		
					Движение.Сотрудник = Строка.Сотрудник;
					Движение.Показатель = 0;
					
					Движение = Движения.ВКМ_Удержания.Добавить();
					Движение.Сторно = Ложь;
					Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
					Движение.ПериодДействияНачало = Строка.ДатаНачала;
					Движение.ПериодДействияКонец = Строка.ДатаОкончания;
					Движение.ПериодРегистрации = Дата;
					Движение.Сотрудник = Строка.Сотрудник;
					
				Иначе
					Продолжить;
					
				КонецЕсли;
				
		КонецЦикла;
	
		Движения.ВКМ_ОсновныеНачисления.Записать();
		Движения.ВКМ_Удержания.Записать();
		
		Для Каждого Движение Из Движения.ВКМ_ОсновныеНачисления Цикл
			
			Если Движение.Вид = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			
				План = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия);
				Факт = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия);
				
				Результат = Движение.Показатель/План[0].РабочихДней*Факт[0].РабочихДней;
				
				Движение.Сумма = Результат;
			
			ИначеЕсли Движение.Вид = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПремияПроцентом Тогда
				
				Продолжить;
					
			ИначеЕсли Движение.Вид = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда				
				
				БазовыйПериодНачало = Дата - 86400*365;
				БазовыйПериодКонец = Дата;
				
				Запрос = Новый Запрос;
				
				Запрос.Текст = "ВЫБРАТЬ
				|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихДнейБазовыйПериод,
				|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихДнейФактическийПериодДействия,
				|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Результат,
				|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход
				|ИЗ
				|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика() КАК ВКМ_ОсновныеНачисленияДанныеГрафика
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления КАК
				|			ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
				|		ПО ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&БазовыйПериодНачало,
				|			&БазовыйПериодКонец,,) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
				|		ПО ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник = ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник
				|ГДЕ
				|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодНачало = &БазовыйПериодНачало
				|	И ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодКонец = &БазовыйПериодКонец
				|	И ВКМ_ОсновныеНачисленияДанныеГрафика.БазовыйПериодКонец = &БазовыйПериодКонец
				|	И ВКМ_ОсновныеНачисленияДанныеГрафика.БазовыйПериодНачало = &БазовыйПериодНачало
				|	И ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник = &Сотрудник";
			КонецЕсли;
			
			Запрос.УстановитьПараметр("БазовыйПериодНачало", БазовыйПериодНачало);						
			Запрос.УстановитьПараметр("БазовыйПериодКонец", БазовыйПериодКонец);	
			Запрос.УстановитьПараметр("Сотрудник", Движение.Сотрудник);	
			
			РезультатЗапроса = Запрос.Выполнить.Выгрузить();
			СтоимостьДняОтпуска = (РезультатЗапроса.Результат + РезультатЗапроса.СуммаКОплатеПриход)/РезультатЗапроса.РабочихДнейФактическийПериодДействия;
			Движение.Сумма = (БазовыйПериодКонец - БазовыйПериодНачало + 86400) / 86400;
					
		КонецЦикла;
		
		Движения.ВКМ_ОсновныеНачисления.Записать();
				
		Для Каждого Движение Из Движения.ВКМ_Удержания Цикл
		
			
			
		КонецЦикла;
		
		Движения.ВКМ_Удержания.Записать();
					
	Иначе
			
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Табличная часть документа не может быть пустой";
		Сообщение.Сообщить();			
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры