
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Начисления.Количество() <> 0 Тогда
	
		РезультатЗапроса = ПолучитьДополнительныеДанныеПоСотрудникам(ЭтотОбъект);
		НоваяТЗдляВставкиВТЧ = РезультатЗапроса.Скопировать(,"Сотрудник, ВидРасчета, ДатаНачала, ДатаОкончания");
		
		Для каждого Строка из РезультатЗапроса Цикл
		
				Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				
					СформироватьДвиженияПоОкладу(Строка);
					
					Если Строка.Категория = Перечисления.ВКМ_КатегорииСотрудников.Специалист Тогда
					
						СформироватьДвиженияПоПремии(Строка);
					
					КонецЕсли;
					
				ИначеЕсли Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
					
					СформироватьДвиженияПоОтпуску(Строка);
					
				Иначе
					Продолжить;
					
				КонецЕсли;
				
		КонецЦикла;
	
		Движения.ВКМ_ОсновныеНачисления.Записать();
		Движения.ВКМ_Удержания.Записать();
		
		Для Каждого Движение Из Движения.ВКМ_ОсновныеНачисления Цикл
			
			Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			
				РассчитатьОклад(Движение);
			
			ИначеЕсли Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПремияПроцентом Тогда
				
				РассчитатьПремию(Движение);
								
			ИначеЕсли Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда				
				
				РассчитатьОтпуск(Движение);
			
		КонецЕсли;
					
		КонецЦикла;
		
		Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
				
		Для Каждого Движение Из Движения.ВКМ_Удержания Цикл
		
			
			
		КонецЦикла;
		
		Движения.ВКМ_Удержания.Записать(, Истина);
					
	Иначе
			
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Табличная часть документа не может быть пустой";
		Сообщение.Сообщить();			
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДополнительныеДанныеПоСотрудникам(ЭтотОбъект)

		// обогащение данных из табличной части документа данными об окладе, категории сотрудника и проценте премии
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Категория,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад,
		|	ВКМ_НачисленияЗарплатыНачисления.Сотрудник,
		|	ВКМ_НачисленияЗарплатыНачисления.ВидРасчета,
		|	ВКМ_НачисленияЗарплатыНачисления.ДатаНачала,
		|	ВКМ_НачисленияЗарплатыНачисления.ДатаОкончания,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот
		|ИЗ
		|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период,) КАК
		|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_НачисленияЗарплатыНачисления.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("Ссылка", Ссылка);	
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
		
		
		// преобразование таблицы (обеспечение наличия премии процентом для всех сотрудников категории "Специалист"
		
		СписокНачислений = Новый ТаблицаЗначений;
		СписокНачислений.Колонки.Добавить("Сотрудник");
		СписокНачислений.Колонки.Добавить("Категория");		
		СписокНачислений.Колонки.Добавить("ВидРасчета");		
		СписокНачислений.Колонки.Добавить("ДатаНачала");			
		СписокНачислений.Колонки.Добавить("ДатаОкончания");			
		СписокНачислений.Колонки.Добавить("Оклад");	
		СписокНачислений.Колонки.Добавить("ПроцентОтРабот");			

		Для Каждого Строка из РезультатЗапроса Цикл
			
			Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				
				НоваяЗапись = СписокНачислений.Добавить();
				НоваяЗапись.Сотрудник = Строка.Сотрудник;
				НоваяЗапись.Категория = Строка.Категория;
				НоваяЗапись.ВидРасчета = Строка.ВидРасчета;
				НоваяЗапись.ДатаНачала = Строка.ДатаНачала;
				НоваяЗапись.ДатаОкончания = Строка.ДатаОкончания;
				НоваяЗапись.Оклад = Строка.Оклад;
				НоваяЗапись.ПроцентОтРабот = Строка.ПроцентОтРабот;	
					
				Если Строка.Категория = Перечисления.ВКМ_КатегорииСотрудников.Специалист Тогда
					
					НоваяЗапись = СписокНачислений.Добавить();
					НоваяЗапись.Сотрудник = Строка.Сотрудник;
					НоваяЗапись.Категория = Строка.Категория;
					НоваяЗапись.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПремияПроцентом;
					НоваяЗапись.ДатаНачала = Строка.ДатаНачала;
					НоваяЗапись.ДатаОкончания = Строка.ДатаОкончания;
					НоваяЗапись.Оклад = Строка.Оклад;
					НоваяЗапись.ПроцентОтРабот = Строка.ПроцентОтРабот;	
			
				КонецЕсли;
			
			ИначеЕсли Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
				
				НоваяЗапись = СписокНачислений.Добавить();
				НоваяЗапись.Сотрудник = Строка.Сотрудник;
				НоваяЗапись.Категория = Строка.Категория;
				НоваяЗапись.ВидРасчета = Строка.ВидРасчета;
				НоваяЗапись.ДатаНачала = Строка.ДатаНачала;
				НоваяЗапись.ДатаОкончания = Строка.ДатаОкончания;
				НоваяЗапись.Оклад = Строка.Оклад;
				НоваяЗапись.ПроцентОтРабот = Строка.ПроцентОтРабот;	
				
			Иначе Продолжить;	
				
			КонецЕсли;
			
		КонецЦикла;
					
		Возврат СписокНачислений;
	
КонецФункции

Процедура СформироватьДвиженияПоОкладу(Строка)
	
	Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = Строка.ВидРасчета;
	Движение.ПериодДействияНачало = Строка.ДатаНачала;
	Движение.ПериодДействияКонец = Строка.ДатаОкончания;
	Движение.ПериодРегистрации = Дата;		
	Движение.Сотрудник = Строка.Сотрудник;
	Движение.Показатель = Строка.Оклад;
	
	Движение = Движения.ВКМ_Удержания.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
	Движение.ПериодДействияНачало = Строка.ДатаНачала;
	Движение.ПериодДействияКонец = Строка.ДатаОкончания;
	Движение.ПериодРегистрации = Дата;
	Движение.Сотрудник = Строка.Сотрудник;

КонецПроцедуры

Процедура СформироватьДвиженияПоПремии(Строка)

	Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПремияПроцентом;
	Движение.ПериодДействияНачало = Строка.ДатаНачала;
	Движение.ПериодДействияКонец = Строка.ДатаОкончания;
	Движение.ПериодРегистрации = Дата;		
	Движение.Сотрудник = Строка.Сотрудник;	
	Движение.Показатель = Строка.ПроцентОтРабот;
			
	Движение = Движения.ВКМ_Удержания.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
	Движение.ПериодДействияНачало = Строка.ДатаНачала;
	Движение.ПериодДействияКонец = Строка.ДатаОкончания;
	Движение.ПериодРегистрации = Дата;
	Движение.Сотрудник = Строка.Сотрудник;

КонецПроцедуры

Процедура СформироватьДвиженияПоОтпуску(Строка)

	Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = Строка.ВидРасчета;
	Движение.ПериодДействияНачало = Строка.ДатаНачала;
	Движение.ПериодДействияКонец = Строка.ДатаОкончания;
	Движение.ПериодРегистрации = Дата;		
	Движение.Сотрудник = Строка.Сотрудник;
	Движение.Показатель = 0;
	
	Движение = Движения.ВКМ_Удержания.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
	Движение.ПериодДействияНачало = Строка.ДатаНачала;
	Движение.ПериодДействияКонец = Строка.ДатаОкончания;
	Движение.ПериодРегистрации = Дата;
	Движение.Сотрудник = Строка.Сотрудник;
	
КонецПроцедуры

Процедура РассчитатьОклад(Движение)

	План = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия);
	Факт = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия);
	
	Результат = Движение.Показатель/План[0].РабочихДней*Факт[0].РабочихДней;
	
	Движение.Результат = Результат;
	
КонецПроцедуры

Процедура РассчитатьПремию(Движение)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,,
	|		Сотрудник = &Сотрудник) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты";
	
	Запрос.УстановитьПараметр("Сотрудник", Движение.Сотрудник);
	Запрос.УстановитьПараметр("НачалоПериода", Движение.ПериодДействияНачало);				
	Запрос.УстановитьПараметр("КонецПериода", Движение.ПериодДействияКонец);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СуммаКОплатеПриход")[0];
	
	Движение.Результат = РезультатЗапроса;
	
КонецПроцедуры

Процедура РассчитатьОтпуск(Движение)

	БазовыйПериодНачало = НачалоДня(Дата - 86400*365);
	БазовыйПериодКонец = КонецДня(Дата - 86400);
	
	Ресурсы = Новый Массив(1);
	Ресурсы[0] = "ВКМ_ОсновныеНачисления.Результат";

	Измерения = Новый Структура;
	Измерения.Вставить("Сотрудник", Движение.Сотрудник);
	Измерения.Вставить("БазовыйПериодНачало", БазовыйПериодНачало);
	Измерения.Вставить("БазовыйПериодКонец", БазовыйПериодКонец);	

//	Разрезы = Новый Массив(1);
//	Разрезы.Добавить("ВКМ_ОсновныеНачисления.");
	
	База = РегистрыРасчета.ВКМ_ОсновныеНачисления.ПолучитьБазу(Ресурсы, Измерения, );
//	Результат = База[0].Результат/База[0].ФактическийПериодДействия;
	
//	Запрос = Новый Запрос;
	
//	Запрос.Текст = "ВЫБРАТЬ
//	|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихДнейБазовыйПериод,
//	|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихДнейФактическийПериодДействия,
//	|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Результат,
//	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход,
//	|	ВКМ_ДополнительныеНачисления.Сумма,
//	|	ВКМ_ДополнительныеНачисления.Сумма + ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход +
//	|		ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Результат КАК СовокупныеНачисления
//	|ИЗ
//	|	РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(,,,) КАК
//	|		ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика() КАК ВКМ_ОсновныеНачисленияДанныеГрафика
//	|		ПО ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&БазовыйПериодНачало,
//	|			&БазовыйПериодКонец,,) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
//	|		ПО ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
//	|		ПО ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник = ВКМ_ДополнительныеНачисления.Сотрудник
//	|ГДЕ
//	|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодНачало = &БазовыйПериодНачало
//	|	И ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодКонец = &БазовыйПериодКонец
//	|	И ВКМ_ОсновныеНачисленияДанныеГрафика.БазовыйПериодКонец = &БазовыйПериодКонец
//	|	И ВКМ_ОсновныеНачисленияДанныеГрафика.БазовыйПериодНачало = &БазовыйПериодНачало
//	|	И ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник = &Сотрудник
//	|	И ВКМ_ДополнительныеНачисления.БазовыйПериодКонец = &БазовыйПериодКонец
//	|	И ВКМ_ДополнительныеНачисления.БазовыйПериодНачало = &БазовыйПериодНачало
//	|	И ВКМ_ДополнительныеНачисления.БазовыйПериодКонец = &БазовыйПериодКонец";
//
//	Запрос.Текст = "";
//	
//	Запрос.УстановитьПараметр("БазовыйПериодНачало", БазовыйПериодНачало);						
//	Запрос.УстановитьПараметр("БазовыйПериодКонец", БазовыйПериодКонец);	
//	Запрос.УстановитьПараметр("Сотрудник", Движение.Сотрудник);	
//	
//	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
//	СтоимостьДняОтпуска = (РезультатЗапроса.Результат + РезультатЗапроса.СуммаКОплатеПриход)/РезультатЗапроса.РабочихДнейФактическийПериодДействия;
//	Движение.Сумма = (БазовыйПериодКонец - БазовыйПериодНачало + 86400) / 86400;
	
КонецПроцедуры
